{
	"version": "https://jsonfeed.org/version/1",
	"title": "Constant Noodling",
	"icon": "https://micro.blog/timmckenna/avatar.jpg",
	"home_page_url": "https://timmckenna.micro.blog/",
	"feed_url": "https://timmckenna.micro.blog/feed.json",
	"items": [
		
			{
				"id": "http://timmckenna.micro.blog/2022/11/18/wellthis-just-made.html",
				
				"content_html": "<p>Well&hellip;.this just made my day. I am going to see one of my favorite bands play one of my favorite albums in its entirity for the first and only time in Los Angeles next year.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Well....this just made my day. I am going to see one of my favorite bands play one of my favorite albums in its entirity for the first and only time in Los Angeles next year.\n\n<img src=\"uploads/2022/3bd74682a0.jpg\" width=\"461\" height=\"600\" alt=\"\">\n",
				"date_published": "2022-11-18T15:27:28-05:00",
				"url": "https://timmckenna.micro.blog/2022/11/18/wellthis-just-made.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/11/16/good-people-still.html",
				"title": "Good people still live in Crime Alley.",
				"content_html": "<p>There are a few crystal clear memories I have from when I was 7 years old.</p>\n<p>Being jealous of this girl in my second grade classroom for always winning the art student of month award.</p>\n<p>The small copse of trees in the landscaping of the church at my school that I would hide in and pretend I was a dinosaur.</p>\n<p>Hearing Metallica&rsquo;s Ride The Lightning album in Mr. Ferguson&rsquo;s tape deck as he hauled all the kids in our cub scout pack to camp in his blue passenger.</p>\n<p>But one memory I have that I&rsquo;ve been thinking a lot about lately is my mom telling me about a new Batman cartoon that was going to come out the first week in September in 1992. I was going to turn 8 at the end of September&hellip;and one could think that a 7/8 year old would be thrilled to hear about a Batman cartoon.</p>\n<p>I was initially was not thrilled&hellip;in fact, I thought it would be dumb.</p>\n<p>My parents were pretty loose regard what movies I could watch when I was young&hellip;so I already seen Alien, Predator, and the original Tim Burton Batman movie. Predator was honestly the only nightmare-inducing one&hellip;heat vision was a lot to take in as a little kid. But Batman&hellip;wow&hellip;what a movie! It was way better than that dumb 60&rsquo;s TV Show with Adam West and Burt Ward (I originally thought that era of Batman was cool&hellip;that with watching The Munsters and Gilligan&rsquo;s Island made up much of my live action TV consumption a few years prior.)</p>\n<p>So with the pedestal of 1989&rsquo;s Batman held being placed and the depths of lows being the 60&rsquo;s show&hellip;even as a 7 year old, my mind went to thinking a cartoon is going to suck. So I was initially against the notion of the Batman, The Animated Series to be something I wanted to watch. But a week later with nothing else on TV, I decided to watch it.</p>\n<p>Neurons fired, quasars collided, black holes consumed galaxies, a telegraph began recieving communications and printing its message. Batman, The Animated Series was an inflection point&hellip;There was a before BTAS and after BTAS. From then on I was hooked&hellip;the stories, the drama, the characters, the portrayals&hellip;it was every bit as dark and menacing that I remembered or attributed to the Tim Burton movie, but with more gravitas. This Batman was someone who could scare the souls out of criminals, cops, and anyone in his way. The voice of the Bat had the angst, weight, depth, confidence, and tone that for me that was the voice of Batman.</p>\n<p>Over the years, I consumed everything made by the DC Animated Universe. That iconic voice acting of Kevin Conroy remained a cornerstone of the character. Batman Mask of the Phantasm is still in my top five favorite movies of all time. There are innumerable memories of me watching that original show and all of the spinnoffs, conversations I&rsquo;ve had with friends in the classrooms, on the job, in bars just discussing the mythos and stories of Batman&hellip;all with the voice of the Bat always echoing in my head.</p>\n<p>When I learned of <a href=\"https://www.cnn.com/2022/11/11/entertainment/kevin-conroy-death-batman-voice-cec/index.html\">Kevin Conroy&rsquo;s passing</a> earlier this month&hellip;I sat at my desk and just felt empty. What Kevin brought to Batman was more than just a voice, he brought the characters to life as both Bruce Wayne and Batman. It&rsquo;s difficult to articulate just how Kevin fleshed out the characters simultaneously being separate and connected. I was instantly drawn to his portrayal of the character when I heard him speak. The flood of memories of episodes, interviews, pivotal scenes, all flooded back to me from the initial emptiness&hellip;as if I was standing at the abyss and instead of the abyss blinking&hellip;it gave me back all of the memories and love for Batman, the animated series, and for Kevin.</p>\n<p>My son is four&hellip;he has several Batman themed items in his room and we&rsquo;re going to watch Batman Mask of the Phantasm this weekend. Even at four years old and all of the other Batman media that we have today&hellip;he watched the episode <a href=\"https://youtu.be/D1Ds6LYjg-I\">&ldquo;Almost Got &lsquo;Im&rdquo;</a> and said &ldquo;ooh that&rsquo;s Batman.&rdquo; Damn straight kiddo, damn straight.</p>\n<p>I am glad my snobbish 7 year old critique didn&rsquo;t hold me back from watching that new Batman cartoon in 1992&hellip;it would have never openned doors to wonder, excitement, and appreciation that I hold dearly today. I am so thankful for and appreciative of Kevin Conroy&rsquo;s dedication, humanity, thoughtfulness, and portryal of Batman. Beyond his work, Kevin&rsquo;s love and involvement with the throngs of fans goes beyond all expectations. I hope he knows just much of an impact he has made on us fans.</p>\n<p>Rest In Peace Kevin Conroy. You will always be my Batman.\n<img src=\"https://www.ramascreen.com/wp-content/uploads/2017/10/Batman-The-Animated-Series-e1507567256426.jpg\" alt=\"Batman: The Animated Series!\" title=\"Batman\"></p>\n",
				"content_text": "There are a few crystal clear memories I have from when I was 7 years old.\r\n\r\nBeing jealous of this girl in my second grade classroom for always winning the art student of month award.\r\n\r\nThe small copse of trees in the landscaping of the church at my school that I would hide in and pretend I was a dinosaur.\r\n\r\nHearing Metallica's Ride The Lightning album in Mr. Ferguson's tape deck as he hauled all the kids in our cub scout pack to camp in his blue passenger.\r\n\r\nBut one memory I have that I've been thinking a lot about lately is my mom telling me about a new Batman cartoon that was going to come out the first week in September in 1992. I was going to turn 8 at the end of September...and one could think that a 7/8 year old would be thrilled to hear about a Batman cartoon.\r\n\r\nI was initially was not thrilled...in fact, I thought it would be dumb. \r\n\r\nMy parents were pretty loose regard what movies I could watch when I was young...so I already seen Alien, Predator, and the original Tim Burton Batman movie. Predator was honestly the only nightmare-inducing one...heat vision was a lot to take in as a little kid. But Batman...wow...what a movie! It was way better than that dumb 60's TV Show with Adam West and Burt Ward (I originally thought that era of Batman was cool...that with watching The Munsters and Gilligan's Island made up much of my live action TV consumption a few years prior.) \r\n\r\nSo with the pedestal of 1989's Batman held being placed and the depths of lows being the 60's show...even as a 7 year old, my mind went to thinking a cartoon is going to suck. So I was initially against the notion of the Batman, The Animated Series to be something I wanted to watch. But a week later with nothing else on TV, I decided to watch it.\r\n\r\nNeurons fired, quasars collided, black holes consumed galaxies, a telegraph began recieving communications and printing its message. Batman, The Animated Series was an inflection point...There was a before BTAS and after BTAS. From then on I was hooked...the stories, the drama, the characters, the portrayals...it was every bit as dark and menacing that I remembered or attributed to the Tim Burton movie, but with more gravitas. This Batman was someone who could scare the souls out of criminals, cops, and anyone in his way. The voice of the Bat had the angst, weight, depth, confidence, and tone that for me that was the voice of Batman.\r\n\r\nOver the years, I consumed everything made by the DC Animated Universe. That iconic voice acting of Kevin Conroy remained a cornerstone of the character. Batman Mask of the Phantasm is still in my top five favorite movies of all time. There are innumerable memories of me watching that original show and all of the spinnoffs, conversations I've had with friends in the classrooms, on the job, in bars just discussing the mythos and stories of Batman...all with the voice of the Bat always echoing in my head. \r\n\r\nWhen I learned of [Kevin Conroy's passing](https://www.cnn.com/2022/11/11/entertainment/kevin-conroy-death-batman-voice-cec/index.html) earlier this month...I sat at my desk and just felt empty. What Kevin brought to Batman was more than just a voice, he brought the characters to life as both Bruce Wayne and Batman. It's difficult to articulate just how Kevin fleshed out the characters simultaneously being separate and connected. I was instantly drawn to his portrayal of the character when I heard him speak. The flood of memories of episodes, interviews, pivotal scenes, all flooded back to me from the initial emptiness...as if I was standing at the abyss and instead of the abyss blinking...it gave me back all of the memories and love for Batman, the animated series, and for Kevin. \r\n\r\nMy son is four...he has several Batman themed items in his room and we're going to watch Batman Mask of the Phantasm this weekend. Even at four years old and all of the other Batman media that we have today...he watched the episode [\"Almost Got 'Im\"](https://youtu.be/D1Ds6LYjg-I) and said \"ooh that's Batman.\" Damn straight kiddo, damn straight.\r\n\r\nI am glad my snobbish 7 year old critique didn't hold me back from watching that new Batman cartoon in 1992...it would have never openned doors to wonder, excitement, and appreciation that I hold dearly today. I am so thankful for and appreciative of Kevin Conroy's dedication, humanity, thoughtfulness, and portryal of Batman. Beyond his work, Kevin's love and involvement with the throngs of fans goes beyond all expectations. I hope he knows just much of an impact he has made on us fans.\r\n\r\nRest In Peace Kevin Conroy. You will always be my Batman.\r\n![Batman: The Animated Series!](https://www.ramascreen.com/wp-content/uploads/2017/10/Batman-The-Animated-Series-e1507567256426.jpg \"Batman\")\r\n",
				"date_published": "2022-11-16T21:03:52-05:00",
				"url": "https://timmckenna.micro.blog/2022/11/16/good-people-still.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/11/16/old.html",
				"title": "Old...",
				"content_html": "<p>Recently, a student told me that I&rsquo;m old.</p>\n<p>I responded with &ldquo;You&rsquo;re not even in this class&hellip;GTFO.&rdquo;</p>\n<p>The student responded &ldquo;oh shit&hellip;this isn&rsquo;t the Advertising class?&rdquo;</p>\n<p>&ldquo;No&hellip;it&rsquo;s Web Design &amp; Development 101.&rdquo;</p>\n<p>&ldquo;Oh my bad, you&rsquo;re still old.&rdquo; and they left.</p>\n<p>(btw&hellip;I&rsquo;m 38&hellip;the advertising instructor is 62)</p>\n<p>I may be &ldquo;old&rdquo;&hellip;at least I know what room my class is in.</p>\n",
				"content_text": "Recently, a student told me that I'm old.\r\n\r\nI responded with \"You're not even in this class...GTFO.\"\r\n\r\nThe student responded \"oh shit...this isn't the Advertising class?\"\r\n\r\n\"No...it's Web Design & Development 101.\"\r\n\r\n\"Oh my bad, you're still old.\" and they left.\r\n\r\n(btw...I'm 38...the advertising instructor is 62)\r\n\r\nI may be \"old\"...at least I know what room my class is in.\n",
				"date_published": "2022-11-16T09:47:28-05:00",
				"url": "https://timmckenna.micro.blog/2022/11/16/old.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/11/08/social-blues.html",
				"title": "Social Blues.",
				"content_html": "<p>Well&hellip;I am back. Finally.</p>\n<p>I took a long break because I wasn&rsquo;t sure how I was actually going to keep up with a micro blog. That and I pretty left all social media for the majority of 2022. Maybe I should have seen it coming&hellip;.but Linkedin&hellip;has pretty much turned into a sess pool of ads, vitriol, and just crap content. It has turned into a place where professionalism has taken a back seat to lies, opinions, alternative facts, and trolls. I ended up deleting three years worth of posting from the platform and keep my profile very spartan, very clean purely for the need of job applications needing to see that I am on there.</p>\n<p>I missed the old days of LinkedIn of people sharing worthwhile articles and posts without trying to sell you instantly on their service or product. Groups where pretty fun to be a part of and valuable coming up in your career. The closet thing I have come to finding such same similar focus online is the platform <a href=\"https://read.cv\">Read.cv</a> which seems to be mainly centered around designers.</p>\n",
				"content_text": "Well...I am back. Finally.\r\n\r\nI took a long break because I wasn't sure how I was actually going to keep up with a micro blog. That and I pretty left all social media for the majority of 2022. Maybe I should have seen it coming....but Linkedin...has pretty much turned into a sess pool of ads, vitriol, and just crap content. It has turned into a place where professionalism has taken a back seat to lies, opinions, alternative facts, and trolls. I ended up deleting three years worth of posting from the platform and keep my profile very spartan, very clean purely for the need of job applications needing to see that I am on there. \r\n\r\nI missed the old days of LinkedIn of people sharing worthwhile articles and posts without trying to sell you instantly on their service or product. Groups where pretty fun to be a part of and valuable coming up in your career. The closet thing I have come to finding such same similar focus online is the platform [Read.cv](https://read.cv) which seems to be mainly centered around designers. \r\n\r\n",
				"date_published": "2022-11-08T19:09:42-05:00",
				"url": "https://timmckenna.micro.blog/2022/11/08/social-blues.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/05/10/its-a-good.html",
				"title": "It's a good song",
				"content_html": "<p>Just going to say it.</p>\n<p>4 Non Blondes - What&rsquo;s Up? Is a great song.</p>\n",
				"content_text": "Just going to say it.\n\n4 Non Blondes - What's Up? Is a great song.\n",
				"date_published": "2022-05-10T19:52:04-05:00",
				"url": "https://timmckenna.micro.blog/2022/05/10/its-a-good.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/05/10/listening-to-the.html",
				
				"content_html": "<p>Listening to the Resident Evil: Apocalypse soundtrack, and damn is it still great. <a href=\"https://open.spotify.com/playlist/03IMyh0ACgPGSX7rWiPH2A?si=67fb031a1b514b48\">open.spotify.com/playlist/&hellip;</a></p>\n",
				"content_text": "Listening to the Resident Evil: Apocalypse soundtrack, and damn is it still great. [open.spotify.com/playlist/...](https://open.spotify.com/playlist/03IMyh0ACgPGSX7rWiPH2A?si=67fb031a1b514b48)\n",
				"date_published": "2022-05-10T12:38:08-05:00",
				"url": "https://timmckenna.micro.blog/2022/05/10/listening-to-the.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/04/29/new-personal-website.html",
				"title": "2022 New Personal Website",
				"content_html": "<p>My new <a href=\"https://timmckenna.design\">personal website</a> is live! It seems like every year I tend to redesign my website&hellip;and chances are it won&rsquo;t be the last time I play with and tweak my website. Thankfully since I have been using <a href=\"https://carrd.co\">Carrd</a> it&rsquo;s been incredibly easy to make super-quick updates and edits without really having to write new or edit any existing HTML, CSS, and JS.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "My new [personal website](https://timmckenna.design) is live! It seems like every year I tend to redesign my website...and chances are it won't be the last time I play with and tweak my website. Thankfully since I have been using [Carrd](https://carrd.co) it's been incredibly easy to make super-quick updates and edits without really having to write new or edit any existing HTML, CSS, and JS. \n\n<img src=\"uploads/2022/39c1f074f3.jpg\" width=\"600\" height=\"314\" alt=\"\" />\n",
				"date_published": "2022-04-29T13:48:54-05:00",
				"url": "https://timmckenna.micro.blog/2022/04/29/new-personal-website.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/04/29/morning-walks-with.html",
				
				"content_html": "<p>Morning walks with clear blue waters at Children&rsquo;s Lake in Boiling Springs, PA.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Morning walks with clear blue waters at Children's Lake in Boiling Springs, PA.\n\n<img src=\"uploads/2022/44c066b3a2.jpg\" width=\"450\" height=\"600\" alt=\"\" />\n",
				"date_published": "2022-04-29T08:57:51-05:00",
				"url": "https://timmckenna.micro.blog/2022/04/29/morning-walks-with.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/04/28/nostalgia-about-painting.html",
				"title": "Nostalgia About Painting",
				"content_html": "<p>Let&rsquo;s go back to 2002. I was a junior in high school and I was playing drums in my new band, From Their Eyes. We were doing the bar and local venue circuit and as a metalcore band in Central Pennsylvania, we were doing well beyond expectations of what this area could offer. Maybe it was the recent success of another local metalcore band, <a href=\"https://augustburnsred.com/releases/\">August Burns Red</a>, that contributed to a favorable scene. So we&rsquo;re playing shows regularly on the weekends, and since I am the youngest member of the band and I&rsquo;m still in high school, I am also attending school during the week. Squeeze in a schedule working at my local <a href=\"https://www.sheetz.com/\">Sheetz</a> and practicing at band HQ in New Cumberland&hellip;I&rsquo;m pretty damn busy.</p>\n<p>I wasn&rsquo;t sure how serious the band was going to be&hellip;we had all the hallmarks of commitment, but I was still thinking about a future with more stability&hellip;.so obviously&hellip;that meant art. Because&hellip;what could be more stable, right? lol.</p>\n<p>After high school, I enrolled at my local community college (which we joked was basically 13th grade for our high school) and started taking classes in fine art, specifically painting. With a more open schedule, my band played more shows and I was painting for class. I felt pretty bohemian in my life at this point. But surprisingly, the band took off and we started playing more shows in larger cities and we joined Warped Tour as one of the myriad smaller bands on the smaller stages. I was at an inflection point&hellip;do music or paint.</p>\n<p>I chose music. For three years that was my life; touring, traveling, sleeping poorly, and getting paid shit.</p>\n<p>In 2006, I decided to go back to school after the band dissolved. This time for design. I was still dreaming about being an artist, I just knew I wasn&rsquo;t going to become the next <a href=\"https://www.bromart.com/\">Gerald Brom</a> so design was for me. However, many in my class were also huge art nerds and while our tastes differed dramatically we all enjoyed being exposed to different artists. During this time a guy in my class that started hanging out with me a lot introduced me to <a href=\"https://www.sdbarber.com/\">Shawn Barber</a> with one short, shitty YouTube video of a studio tour (mind you, this was back when YouTube was either just purchased by Google or right before.) The video begins with Shawn painting a portrait of one of my favorite singers of all time, Davey Havok of AFI. So I was hooked on this guy and his style and technique. That was back in 2006.</p>\n<p>Well&hellip;looks like that <a href=\"https://youtu.be/QclMx3zx8So\">shitty studio tour video</a> still exists and you should check it out. Seeing this video&hellip;makes we want to dig out all of my old oil paints again.</p>\n",
				"content_text": "Let's go back to 2002. I was a junior in high school and I was playing drums in my new band, From Their Eyes. We were doing the bar and local venue circuit and as a metalcore band in Central Pennsylvania, we were doing well beyond expectations of what this area could offer. Maybe it was the recent success of another local metalcore band, [August Burns Red](https://augustburnsred.com/releases/), that contributed to a favorable scene. So we're playing shows regularly on the weekends, and since I am the youngest member of the band and I'm still in high school, I am also attending school during the week. Squeeze in a schedule working at my local [Sheetz](https://www.sheetz.com/) and practicing at band HQ in New Cumberland...I'm pretty damn busy.\r\n\r\nI wasn't sure how serious the band was going to be...we had all the hallmarks of commitment, but I was still thinking about a future with more stability....so obviously...that meant art. Because...what could be more stable, right? lol.\r\n\r\nAfter high school, I enrolled at my local community college (which we joked was basically 13th grade for our high school) and started taking classes in fine art, specifically painting. With a more open schedule, my band played more shows and I was painting for class. I felt pretty bohemian in my life at this point. But surprisingly, the band took off and we started playing more shows in larger cities and we joined Warped Tour as one of the myriad smaller bands on the smaller stages. I was at an inflection point...do music or paint. \r\n\r\nI chose music. For three years that was my life; touring, traveling, sleeping poorly, and getting paid shit.\r\n\r\nIn 2006, I decided to go back to school after the band dissolved. This time for design. I was still dreaming about being an artist, I just knew I wasn't going to become the next [Gerald Brom](https://www.bromart.com/) so design was for me. However, many in my class were also huge art nerds and while our tastes differed dramatically we all enjoyed being exposed to different artists. During this time a guy in my class that started hanging out with me a lot introduced me to [Shawn Barber](https://www.sdbarber.com/) with one short, shitty YouTube video of a studio tour (mind you, this was back when YouTube was either just purchased by Google or right before.) The video begins with Shawn painting a portrait of one of my favorite singers of all time, Davey Havok of AFI. So I was hooked on this guy and his style and technique. That was back in 2006.\r\n\r\nWell...looks like that [shitty studio tour video](https://youtu.be/QclMx3zx8So) still exists and you should check it out. Seeing this video...makes we want to dig out all of my old oil paints again.\r\n",
				"date_published": "2022-04-28T09:35:26-05:00",
				"url": "https://timmckenna.micro.blog/2022/04/28/nostalgia-about-painting.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/04/27/currently-reading-radical.html",
				"title": "Reading",
				"content_html": "<p>Currently reading: <a href=\"https://micro.blog/books/9781523093328\">Radical Product Thinking</a> by R. Dutt 📚</p>\n<p>As a product design director, I think about how disruptive products are often moonshots based on actual needs that people have&hellip;.but how we approach to improving those eventual products and services is a slow, often fraught with errors, iterative process. I&rsquo;ve said it before and I&rsquo;ll say it again&hellip;research needs to fuel your product development&hellip;otherwise you&rsquo;re just guessing at shit.</p>\n",
				"content_text": "Currently reading: [Radical Product Thinking](https://micro.blog/books/9781523093328) by R. Dutt 📚\n\nAs a product design director, I think about how disruptive products are often moonshots based on actual needs that people have....but how we approach to improving those eventual products and services is a slow, often fraught with errors, iterative process. I've said it before and I'll say it again...research needs to fuel your product development...otherwise you're just guessing at shit.\n",
				"date_published": "2022-04-27T14:49:00-05:00",
				"url": "https://timmckenna.micro.blog/2022/04/27/currently-reading-radical.html"
			},
			{
				"id": "http://timmckenna.micro.blog/2022/04/27/back-to-blogging.html",
				"title": "Back to Blogging",
				"content_html": "<p>It&rsquo;s been a few years since I&rsquo;ve kept a blog, but I am pretty happy to be back and using Micro.blog as my host!</p>\n",
				"content_text": "It's been a few years since I've kept a blog, but I am pretty happy to be back and using Micro.blog as my host!\n",
				"date_published": "2022-04-27T11:47:00-05:00",
				"url": "https://timmckenna.micro.blog/2022/04/27/back-to-blogging.html"
			}
	]
}
